Revit 2024 API
Alignment.GetVCurveTangentAtStation Method
 Calculate 2d (X and Y components of returned vector) vertical tangent at given station.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public XYZ GetVCurveTangentAtStation(
	double station
)
Visual Basic
Public Function GetVCurveTangentAtStation ( _
	station As Double _
) As XYZ
Visual C++
public:
XYZ^ GetVCurveTangentAtStation(
	double station
)
Parameters
station
Type: System.Double
Alignment station to calculate 2d vertical tangent for, in Revit internal model units (standard Imperial feet).
Return Value
2d (X and Y components of returned vector) vertical tangent at given station.
See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace